var demo = document.getElementById("demo");
var next = document.getElementById('next')
var i = 0;
var replika = -1;
var txt = ["Коя е най-травмиращата случка в живота ви?", "Каква шокираща тайна дълго време пазите от своите приятели и семейство?", "Кой е най-жестокият слух, който сте чували за друго дете в училище?", "Кой е вашият бъг в матрицата?", "Коя се най-абсурдната случка, на която сте присъствали по време на погребение?", "Случвало ли ви се е да видите нещо, което не е било предназначено за вас?", "Кое е нещото, което искате да кажете на някого, но ви липсва смелост?", "Случвало ли ви се е да измамите системата?", "Коя e най-голямата споделена ви тайна, която пазите?", "Кой е вашият „бъг в матрицата“?", "Коя е най-голямата споделена ви тайна, която пазите?", "Кой е най-лошият начин, по който някой се е отнасял с детето си?", "Каква шокираща тайна дълго време пазите от своите приятели и семейство?", "Случвало ли ви се е да видите нещо в дома на други хора, което те възприемат за нормално, а вие не?", "Случвало ли ви се е да видите нещо в дома на други хора, което те възприемат за нормално, а вие не?", "Кое е най-странното нещо, което сте виждали на чужд компютър?", "Коя е най-лошата ви постъпка?", "Случвало ли ви се е да сте имали предчувствие, което се е оказало правилно и ви е спасило от нещо страшно?", "Кой е най-големият ви провал на първа среща?", "Случвало ли ви се е някога да направите нещо толкова абсурдно, че  заради вас да поставят специален знак, че не се прави така?", "Случвало ли ви се е да сте имали предчувствие, което се е оказало правилно и ви е спасило от нещо страшно?", "Изпращали ли сте някога съобщение по погрешка?", "Коя е най-дълбоката ви тайна?", "Кое е най-объркващото нещо, което ви се е случвало?", "Случвало ли ви се е някога да измамите системата?", "Кой е най-лошият начин, по който някой се е отнасял с детето си?", "Коя е най-абсурдната случка, на която сте присъствали по време на погребение?", "Коя е най-дълбоко пазената ви тайна?Коя е най-дълбоко пазената ви тайна?", "Кой е най-добрият начин, чрез който сте манипулирали някого?", "Коя е най-абсурдната случка, на която сте присъствали по време на погребение?"];
var audio = new Audio('sound.mp3');



function typeWriter() {
    var speed = 1500 / txt[replika].length;
    if (i === 0)
    demo.innerHTML = '';

    if (i < txt[replika].length) {
       demo.textContent += txt[replika].charAt(i);
       i++;
       setTimeout(typeWriter, speed);
    }
}

function Delete() {
    var speed = 1500 / txt[replika].length;

    if (i >= 0) {
       demo.textContent = demo.textContent.slice(0, i)
       i--;
       setTimeout(Delete, speed);
    } 
}


next.addEventListener('click', () => { 
    next.disabled = true
    if(demo.textContent.length != 0) {
        Delete()
    }
    else{i = 0
    ++replika
    typeWriter()
    audio.play()
    }

    setTimeout(() => {
        next.removeAttribute('disabled')
    }, 1650)
})

console.log(demo.textContent.length)